Project/Toir/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/CommonModules/торо_ОбщегоНазначенияКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция формирует строку в формате ч. мин. с. по продолжительности в секундах.
// Есть возможность задания произвольного представления для нуля.
//
// Параметры:
//		ПродолжительностьВСекундах - Число - продолжительность в секундах.
//		ПредставлениеНуля - Строка - представление нулевого значения.
//
// Возвращаемое значение:
//		Строка - строковое представление времени.
Функция СформироватьЗаголовокПоПродолжительности(ПродолжительностьВСекундах,ПредставлениеНуля = Неопределено) Экспорт
	
	Если ПродолжительностьВСекундах = null Тогда
		
		Возврат "";
	
	ИначеЕсли ПродолжительностьВСекундах = 0 Тогда
		
		Если ПредставлениеНуля = Неопределено Тогда
			Возврат НСтр("es='Introducir la duración';ru='Ввести продолжительность';en='Enter duration'");
		Иначе
			Возврат ПредставлениеНуля;
		КонецЕсли;
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		Возврат СтрШаблон(НСтр("es='%1 h. %2 minutos %3 con.';ru='%1 ч. %2 мин. %3 с.';en='%1 hr.%2 min. %3 s'"),Часы,Минуты,Секунды);
		
	КонецЕсли;
		
КонецФункции

// Возвращает фильтр, используемый для выбора файлов-изображений.
// Возвращаемое значение:
// 	Строка - строка, содержащая фильтр для файлов-изображений.
//
Функция ФильтрФайловИзображений() Экспорт
	Возврат НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
		                            + "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
		                            + "|Формат GIF(*.gif*)|*.gif"
		                            + "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
		                            + "|Формат PNG(*.png*)|*.png"
		                            + "|Формат TIFF(*.tif)|*.tif"
		                            + "|Формат icon(*.ico)|*.ico"
		                            + "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
КонецФункции

// Возвращает строку дерева, расположенного на форме, с заданным значеним в колонке.
// Параметры:
//		СтрокиДерева - ДанныеФормыКоллекцияЭлементовДерева - Строки дерева, в которых начинается поиск.
//		ИмяКолонкиПоиска - Строка - Имя колонки, по которой нужно искать.
//		Значение - Произвольный - Значение, которое нужно найти.
// Возвращаемое значение:
//		ДанныеФормыЭлементДерева, Неопределено - Первая найденная строка дерева или Неопределено.
//
Функция НайтиСтрокуВДеревеФормы(СтрокиДерева, ИмяКолонкиПоиска, Значение) Экспорт
	
	Для каждого СтрокаДерева из СтрокиДерева Цикл
		Если СтрокаДерева[ИмяКолонкиПоиска] = Значение Тогда
			Возврат СтрокаДерева;
		КонецЕсли;
		
		НайденнаяСтрокаВПоддереве = НайтиСтрокуВДеревеФормы(СтрокаДерева.ПолучитьЭлементы(), ИмяКолонкиПоиска, Значение);
		Если НайденнаяСтрокаВПоддереве <> Неопределено Тогда
			Возврат НайденнаяСтрокаВПоддереве;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Добавляет к переданной дате начала указанное количество периодов.
// В отличие от аналогичной процедуры в ОбщегоНазначенияУТКлиентСервер, возвращает значение без "КонецДня" 
// Параметры:
// 	ДатаНачала         - Дата - дата начала, от которой будет рассчитана дата окончания периода.
// 	Периодичность      - ПеречислениеСсылка.Периодичность - Периодичность.
// 	КоличествоПериодов - Число - количество повторов периода.
//
// Возвращаемое значение:
// 	Дата - Дата окончания периода.
//
Функция РассчитатьДатуОкончанияПериода(ДатаНачала, Периодичность, КоличествоПериодов) Экспорт

	ОдинДень = 86400;

	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда 
		
		ДатаОкончания = ДатаНачала + ОдинДень * КоличествоПериодов;

	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
		
		ДатаОкончания = ДатаНачала + ОдинДень * 7 * КоличествоПериодов;

	ИначеЕсли (Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада")) Тогда
		
		ДеньМесяца = День(ДатаНачала);
		НачМесяца = НачалоМесяца(ДатаНачала);
		Если ДеньМесяца <= 10 Тогда
			НомерДекады = 1;
		ИначеЕсли ДеньМесяца <= 20 Тогда
			НомерДекады = 2;
		Иначе
			НомерДекады = 3;
		КонецЕсли;
			
		НомерДекады = НомерДекады + КоличествоПериодов;
		
		Если НомерДекады > 0 Тогда
			Месяцев = Цел((НомерДекады-1)/3);
		Иначе
			Месяцев = -1 - Цел((-НомерДекады)/3);
		КонецЕсли;
			
		НомерДекады = НомерДекады - 3*Месяцев;
		Дт = ДобавитьМесяц(НачМесяца, Месяцев) + (НомерДекады-1) * 10 * ОдинДень;

		Если КоличествоПериодов > 0 Тогда
			ДатаОкончания = Дт;
		
		Иначе 
			ДеньМесяца = День(Дт);

			Если ДеньМесяца <= 10 Тогда
				ДатаОкончания = КонецДня(НачалоМесяца(Дт) + ОдинДень * 9);
			ИначеЕсли ДеньМесяца <= 20 Тогда
				ДатаОкончания = КонецДня(НачалоМесяца(Дт) + ОдинДень * 19);
			Иначе
				ДатаОкончания = КонецМесяца(Дт);
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли (Периодичность= ПредопределенноеЗначение("Перечисление.Периодичность.Месяц")) Тогда
		
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, КоличествоПериодов);

	ИначеЕсли (Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал")) Тогда
		
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, 3 * КоличествоПериодов);

	ИначеЕсли (Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие")) Тогда
		
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, 6 * КоличествоПериодов);

	ИначеЕсли (Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год")) Тогда
		
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, 12 * КоличествоПериодов);

	КонецЕсли;
			
	Возврат ДатаОкончания;

КонецФункции // РассчитатьДатуОкончанияПериода()

#КонецОбласти
